# -*- coding: cp949 -*-

import os
from collections import Counter
import math
import numpy as np
from PIL import Image
import numpy as np
from sklearn.cluster import KMeans
import matplotlib.pyplot as plt
import os


RestArt_color = {
    ((207, 46, 49), (231, 47, 39)): "Cinnabar",
    (172, 35, 48): "Guardsman Red",
    (233, 163, 144): "Tonys Pink",
    (231, 108, 86): "Terra Cotta",
    (236, 217, 202): "Almond",
    (213, 182, 166): "Clam Shell",
    ((211, 142, 110), (215, 145, 96)): "Feldspar",
    ((171, 131, 115), (158, 128, 110), (148, 133, 105), (160, 147, 131)): "Hemp",
    ((162, 88, 61), (167, 100, 67), (169, 87, 49)): "Tuscany",
    ((116, 47, 50), (111, 61, 56)): "Tamarillo",
    ((115, 63, 44), (79, 46, 43), (85, 55, 43), (75, 63, 45), (88, 60, 50)): "Cioccolato",
    ((238, 113, 25), (226, 132, 45)): "Pumpkin",
    ((241, 176, 102), (242, 178, 103)): "Harvest Gold",
    ((255, 200, 8), (227, 189, 28), (255, 203, 88), (155, 196, 113)): "Yellow",
    ((255, 228, 15), (255, 236, 79)): "Paris Daisy",
    ((170, 198, 27), (162, 179, 36), (169, 199, 35), (195, 202, 101)): "Bahia",
    (219, 220, 93): "Manz",
    ((19, 166, 50), (18, 154, 47), (88, 171, 45)): "Forest Green",
    ((146, 198, 131), (141, 188, 90), (140, 195, 110)): "Mantis",
    ((4, 148, 87), (6, 134, 84), (43, 151, 89)): "Salem",
    ((39, 122, 62), (23, 106, 43), (20, 114, 48), (30, 98, 50)): "Camarone",
    ((1, 134, 141), (3, 130, 122), (0, 147, 159), (117, 173, 169)): "Eastern Blue",
    (53, 109, 98): "Genoa",
    ((3, 86, 155), (44, 77, 143)): "Cobalt",
    ((6, 113, 148), (59, 130, 157)): "Cerulean",
    ((46, 20, 141), (58, 55, 119)): "Persian Indigo",
    ((44, 60, 49), (53, 52, 48), (60, 60, 60), (38, 38, 38), (10, 10, 10)): "Black",
    ((244, 244, 244), (236, 236, 236)): "White Smoke",
    ((206, 206, 206), (180, 180, 180), (184, 190, 189), (151, 150, 139)): "Very Light Grey",
    ((152, 152, 152), (126, 126, 126), (86, 86, 86)): "Grey",
    ((40, 47, 103), (34, 54, 68)): "Deep Koamaru",
    ((34, 62, 51), (31, 56, 45), (29, 60, 47), (25, 62, 63)): "Palm Green",
    ((245, 223, 181), (228, 235, 191), (233, 227, 143), (249, 239, 189)): "Corn Field",
    ((24, 89, 63), (20, 88, 60), (18, 83, 65), (27, 86, 49)): "Fun Green",
    ((8, 87, 107), (16, 76, 84)): "Sherpa Blue",
    ((197, 188, 213), (170, 165, 199)): "Wistful",
    ((127, 175, 166), (130, 154, 145), (133, 154, 153)): "Granny Smith",
    ((147, 184, 213), (138, 166, 187)): "Nepal",
    ((218, 176, 176), (205, 154, 149)): "Rose",
    ((144, 135, 96), (109, 116, 73)): "Granite Green",
    ((88, 126, 61), (91, 132, 47)): "Dingley",
    ((139, 117, 65), (103, 91, 44)): "Costa Del Sol",
    (204, 63, 92): "Mandy",
    (92, 104, 106): "Pale Sky",
    (175, 97, 87): "Au Chico",
    (178, 137, 166): "London Hue",
    (209, 100, 109): "Cabaret",
    (126, 188, 209): "Seagull",
    (221, 232, 207): "Frostee",
    (209, 234, 211): "Aqua Squeeze",
    (194, 222, 242): "Pattens Blue",
    (203, 215, 232): "Hawkes Blue",
    (224, 218, 230): "Titan White",
    (235, 219, 224): "Pale Rose",
    (218, 196, 148): "Raffia",
    (209, 116, 73): "Red Damask",
    (179, 202, 157): "Sprout",
    (166, 201, 163): "Spring Rain",
    (165, 184, 199): "Heather",
    (206, 185, 179): "Wafer",
    (143, 162, 121): "Sage",
    (122, 165, 123): "Oxley",
    (156, 137, 37): "Lemon Ginger",
    (115, 71, 79): "Tosca",
    (54, 88, 48): "Green House"
}
RestArt_color_onlyone = {
    'Cinnabar': (207, 46, 49),
     'Guardsman Red': (172, 35, 48),
     'Tonys Pink': (233, 163, 144),
     'Terra Cotta': (231, 108, 86),
     'Almond': (236, 217, 202),
     'Clam Shell': (213, 182, 166),
     'Feldspar': (211, 142, 110),
     'Hemp': (171, 131, 115),
     'Tuscany': (162, 88, 61),
     'Tamarillo': (116, 47, 50),
     'Cioccolato': (115, 63, 44),
     'Pumpkin': (238, 113, 25),
     'Harvest Gold': (241, 176, 102),
     'Yellow': (255, 200, 8),
     'Paris Daisy': (255, 228, 15),
     'Bahia': (170, 198, 27),
     'Manz': (219, 220, 93),
     'Forest Green': (19, 166, 50),
     'Mantis': (146, 198, 131),
     'Salem': (4, 148, 87),
     'Camarone': (39, 122, 62),
     'Eastern Blue': (1, 134, 141), 
     'Genoa': (53, 109, 98), 
     'Cobalt': (3, 86, 155), 
     'Cerulean': (6, 113, 148),
     'Persian Indigo': (46, 20, 141),
     'Black': (44, 60, 49),
     'White Smoke': (244, 244, 244),
     'Very Light Grey': (206, 206, 206),
     'Grey': (152, 152, 152), 
     'Deep Koamaru': (40, 47, 103),
     'Palm Green': (34, 62, 51),
     'Corn Field': (245, 223, 181), 
     'Fun Green': (24, 89, 63),
     'Sherpa Blue': (8, 87, 107), 
     'Wistful': (197, 188, 213), 
     'Granny Smith': (127, 175, 166),
     'Nepal': (147, 184, 213), 
     'Rose': (218, 176, 176), 
     'Granite Green': (144, 135, 96), 
     'Dingley': (88, 126, 61),
     'Costa Del Sol': (139, 117, 65), 
     'Mandy': (204, 63, 92),
     'Pale Sky': (92, 104, 106),
     'Au Chico': (175, 97, 87), 
     'London Hue': (178, 137, 166),
     'Cabaret': (209, 100, 109),
     'Seagull': (126, 188, 209),
     'Frostee': (221, 232, 207), 
     'Aqua Squeeze': (209, 234, 211),
     'Pattens Blue': (194, 222, 242),
     'Hawkes Blue': (203, 215, 232), 
     'Titan White': (224, 218, 230),
     'Pale Rose': (235, 219, 224), 
     'Raffia': (218, 196, 148), 
     'Red Damask': (209, 116, 73),
     'Sprout': (179, 202, 157), 
     'Spring Rain': (166, 201, 163),
     'Heather': (165, 184, 199), 
     'Wafer': (206, 185, 179), 
     'Sage': (143, 162, 121), 
     'Oxley': (122, 165, 123),
     'Lemon Ginger': (156, 137, 37), 
     'Tosca': (115, 71, 79),
     'Green House': (54, 88, 48)}
# 이미지에서 추출한 주요 색상 매핑 및 빈도 계산 함수


1. 너는 색에 대한 전문적인 지식을 가지고 있어.
2. 색에 대한 특징과 분석을 바탕으로 어떤 색을 좋아하냐에 따라 그 사람을 잘 설명할 수 있어.
3. 응답의 일반적인 길이는 3~4문장이면 좋겠어.
4. 너무 격식을 차릴 필요는 없고 자유로운 분위기로 설명해줬으면 좋겠어.


1. 너는 그림에 대한 전문적인 지식을 가지고 있어.
2. 그림을 설명하는데 전문적인 표현보다는 그림을 묘사하는 식으로 자세하게 설명해줘.
3. 응답의 일반적인 길이는 4~5문장이면 좋겠어.
4. 너무 격식을 차릴 필요는 없고 자유로운 분위기로 설명해줬으면 좋겠어.



1. 너는 그림에 대한 전문적인 지식을 가지고 있어.
2. 이미지와 설명을 보고 15개의 감정 카테고리 중 가장 이미지를 잘 표현하는 감정 3개를 골라줘.
감정 카테고리 :행복, 기쁨, 사랑, 세련됨, 감각적, 호기심, 경외심, 슬픔, 미움, 걱정, 혼란, 공포, 노여움, 욕심, 동정